Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/mobility-omegat.tmx
Source language: en_us
Languages: pt_br

source: {0} Fatal Error(s), {1} Error(s), {2} Warning(s)
pt_br: {0} erro(s) fatal, {1} erro(s), {2} aviso(s)

source: Current time:
pt_br: Hora atual:

source: Sets current time on timeline
pt_br: Configura hora atual na linha de tempo

source: End time:
pt_br: Hora de finalizar:

source: Sets maximum time on timeline
pt_br: Configura hora máxima na linha do tempo

source: Type: {0}
pt_br: Tipo: {0}

source: Select SVG file
pt_br: Selecionar arquivo SVG

source: {0} is not valid SVG file!
pt_br: {0} não é válido para arquivo SVG!

source: LOCKED
pt_br: BLOQUEADO

source: SVG document is locked and cannot be edited.
pt_br: Documento SVG está bloqueado e não pode ser editado.

source: SVG document is unlocked and editable.
pt_br: Documento SVG está desbloqueado e editável.

source: The following element identifier(s) have been changed to resolve conflicts:
pt_br: O(s) identificador (es) de elemento seguinte foram alterados para solucionar conflitos:

source: Some identifiers defined in the selected element are referenced from outside:
pt_br: Alguns identificadores definidos no elemento selecionado são referenciados de fora:

source: {0} Do you want to delete them manually?
pt_br: {0} Deseja excluí-los manualmente?

source: Filters:
pt_br: Filtros:

source: Show Attributes
pt_br: Exibir atributos

source: Show Attributes of SVG Tags
pt_br: Exibir atributos de marcadores SVG

source: Show SVG Tags with ID Only
pt_br: Exibir marcadores SVG com apenas ID

source: Show SVG Animation Tags Only
pt_br: Exibir apenas marcadores de animação SVG

source: Click or press {0} to hide/show when Navigator is active
pt_br: Clique ou pressione {0} para esconder/exibir quando navegador está ativo

source: SVG files navigator
pt_br: Navegador de arquivos SVG

source: SVG View
pt_br: Visualizar SVG

source: Please Wait...
pt_br: Por favor aguarde...

source: Not Tiny SVG File - Cannot Navigate.
pt_br: Nenhum arquivo Tiny SVG - Não foi possivel navegar.

source: Loading {0}...
pt_br: Carregando {0}...

source: SVG Editor
pt_br: Editor SVG

source: Launching {0} ...
pt_br: Lançando {0} ...

source: SVG Editor executable {0} does not exists!
pt_br: Editor SVG executável {0} does not exists!

source: SVG Editor executable is not set!
pt_br: Editor SVG executável não está definido!

source: SVG Settings for external tools
pt_br: Configurações SVG para ferramentas externa

source: &External Editor Path:
pt_br: Caminho do editor &externo:

source: {0} is not valid installation location!
pt_br: {0} não é uma localilzação de instalação válida!

source: NetBeans MIDP Components SVG
pt_br: NetBeans MIDP componentes SVG

source: Perseus SVG Library
pt_br: Perseus biblioteca SVG

source: Java ME Visual Editor
pt_br: Editor visual Java ME

source: Java Mobile Edition Visual Editor
pt_br: Editor visual edição Java móvel

source: Java Mobile Edition Visual Editor allows user to edit screens and MIDlets flow
pt_br: Editor visual edição Java móvel permite o usuário editar telas e fluxos MIDlets

source: &Installed Libraries:
pt_br: Bibliotecas &instaladas:

source: &Edit...
pt_br: &Editar...

source: &Project Name:
pt_br: Nome do &projetoA seguinte elemento identificador (es) foram alterados para solucionar conflitos:

source: Select Project JAR &Files:
pt_br: Selecionar projeto de &arquivos JAR:

source: Add Selected Project JAR Files
pt_br: Adicionar projeto selecionado de arquivos JAR

source: Select Built JARs
pt_br: Selecionar construir JARs

source: Select Project Directory
pt_br: Selecionar diretório de projeto

source: Project:
pt_br: Projeto:

source: Installed Libraries:
pt_br: Bibliotecas instaladas:

source: Source Packages
pt_br: Pacotes de código-fonte

source: Two projects referencing the same source folder cannot be opened at the same time.
pt_br: Dois projetos referenciando a mesma pasta do código-fonte não podem abrir ao mesmo tempo.

source: Project "{1}" will be closed prior to opening of project "{0}".
pt_br: Projeto "{1}" será fechado antes de abrir o projeto "{0}".

source: Cannot parse suite file.
pt_br: Não é possível analisar o arquivo.

source: Empty project is created.
pt_br: Projeto vazio é criado.

source: Http Server is no running.
pt_br: Seridor http não está em execução.

source: Start it first.
pt_br: Iniciar primeiro.

source: Quick Project Run
pt_br: Executar projeto rápido

source: Java ME Build System Core
pt_br: Núcleo de sistema de construção Java ME

source: Java Mobile Edition Build System Core
pt_br: Núcleo de sistema de construção e edição Java Móvel

source: Run Project
pt_br: Executar projeto

source: Debug Project
pt_br: Depurar projeto

source: User saved project configuration templates
pt_br: Usuário salvou modelos de configuração de projeto

source: <empty project configuration>
pt_br: <configuração de projeto vazio>

source: Select &Platform:
pt_br: Selecionar &plataforma:

source: Select &Device:
pt_br: Selecionar &dispositivo:

source: Quick Run Panel
pt_br: Painel de execução rápida

source: Run project with selected platform without rebuilding
pt_br: Executar projeto com plataforma selecionada sem reconstrução

source: Current distribution Jar will be used for execution on selected platform.
pt_br: Distribui~ao atual jar será usada para execução na plataforma selecionada.

source: Project will not be built.
pt_br: Projeto não será construído.

source: Set Active Project Configuration
pt_br: Definir configuração de projeto ativo

source: Add configuration to project...
pt_br: Adicionar configuração para projeto...

source: Clean
pt_br: Limpar

source: Build
pt_br: Construir

source: Clean & Build
pt_br: Limpar & Construir

source: Run
pt_br: ExecutarRun

source: Run With...
pt_br: Executar com...

source: Debug
pt_br: Depurar

source: Generate Javadoc
pt_br: Gerar javadoc

source: Deploy
pt_br: Implantar

source: Batch Clean...
pt_br: Limpar lote...

source: Batch Build...
pt_br: Construir lote...

source: Batch Clean & Build...
pt_br: Limpar & Construir lote...

source: Batch Deploy...
pt_br: Implantar lote...

source: Resolve Reference Problems...
pt_br: Resolver problemas de referência...

source: Refresh Folders
pt_br: Atualizar pastas

source: Run Configuration
pt_br: Executar configuração

source: Debug Configuration
pt_br: Depurar configuração

source: Build &All Main Project Configurations
pt_br: Construir &todas configurações de projeto principal

source: C&lean and Build All Main Project Configurations
pt_br: L&impar e construir todas configurações de projeto principal

source: Duplicate Project...
pt_br: Duplicar projeto...

source: Duplicate Project {0}
pt_br: Duplicar projeto {0}

source: Cyclic Project Depenedencies
pt_br: Dependências de projeto cíclico

source: Cyclic project dependencies have been detected.
pt_br: Dependências de projeto cíclico tem sido detectado.

source: &Involved Projects:
pt_br: Projetos &envolvidos:

source: &Do not display this warning again
pt_br: &Não exibir este aviso novamente

source: Cyclic Project Depenedencies Warning Panel
pt_br: Painel de avisos das dependências de projeto cíclico

source: Project Configurations
pt_br: Configurações de projeto

source: Resources - Inherited from {0}
pt_br: Recursos - herdados de {0}

source: Project Properties
pt_br: Propriedades do projeto

source: Shared Ant properties of this project.
pt_br: Propriedades compartilhadas Ant deste projeto.

source: Private Properties
pt_br: Propriedades privada

source: Private Ant properties of this project.
pt_br: Propriedades privada Ant deste projeto.

source: Evaluated Properties
pt_br: Propriedades avaliadas

source: All Ant properties of this project in their evaluated form, excepting system properties
pt_br: Todas propriedades Ant deste projeto em seus formulários avaliados, exceto propriedades do sistema.

source: Circular references detected in Ant properties.
pt_br: Referencias circular detectadas em propriedades Ant.

source: Project
pt_br: Projeto

source: General aspects of this project.
pt_br: Aspectos geral deste projeto.

source: Location
pt_br: Localização

source: Location of the root of this project on disk.
pt_br: Localização de root deste projeto em disco.

source: Code Name
pt_br: Nome do código

source: Internal name of this project, used during building and so on.
pt_br: Nome interno deste projeto, usado durante a construção e assim por diante.

source: Display Name
pt_br: Nome de exibição

source: Display name of this project for presentation.
pt_br: Nome de exibição deste projeto para apresentação.

source: Subproject Names
pt_br: Nomes de sub-projetos

source: (Code) names of configured subprojects.
pt_br: (Código) nomes de sub-projetos configurados.

source: Required Ant Version
pt_br: Versão Ant requerida

source: Which version of Ant should be required to run this project.
pt_br: Qual versão de Ant deverá ser requerida para executar este projeto.

source: Later versions may provide more capabilities.
pt_br: Versões posteriores poderão fornecer mais capacidades.

source: Physical View
pt_br: Visualização física

source: Logical View
pt_br: Visualização lógica

source: &Set Main Project Configuration
pt_br: &Definir configuração de projeto principal

source: Multiple different values ...
pt_br: Valores múltiplos diferentes ...

source: Multiple configurations
pt_br: Configurações múltiplas

source: Copy
pt_br: Copiar

source: Paste
pt_br: Colar

source: Apply
pt_br: Aplicar

source: Project Dependencies
pt_br: Dependências de Projeto

source: Libraries
pt_br: Bibliotecas

source: Compiling Classes
pt_br: Compilar classes

source: Creating Jar
pt_br: Criando jar

source: Running
pt_br: Em execução

source: Debugging
pt_br: Depurando

source: Creating Javadoc
pt_br: Criando Javadoc

source: Testing
pt_br: Testando

source: Configurations Removed
pt_br: Configurações removidas

source: <default package>
pt_br: <pacote padrão>

source: {0} (Java source package)
pt_br: {0} (pacote de código-fonte Java)

source: {0} (exported Java source package)
pt_br: {0} (pacote de código-fonte Java exportado)

source: {0} (private Java source package)
pt_br: {0} (pacote de código-fonte Java privado)

source: Build Selected Project Configurations
pt_br: Construir configurações de projeto selecionado

source: Clean Selected Project Configurations
pt_br: Limpar configurações de projeto selecionado

source: Clean & Build Selected Project Configurations
pt_br: Limpar & Construir configurações de projeto selecionado

source: Build Javadoc for Selected Project Configurations
pt_br: Construir javadoc para configurações de projeto selecionado

source: Deploy Selected Project Configurations
pt_br: Implantar configurações de projeto selecionado

source: Select Project Configurations:
pt_br: Selecionar configurações de projeto:

source: Imports an existing MIDP application from existing sources and an optional application descriptor into a standard IDE project.
pt_br: Importa um aplicativo MIDP existente</ b0> de códigos-fonte existentes e um descritor de aplicação opcional em um projeto padrão IDE.

source: This project uses an IDE-generated Ant build script and special tasks to preprocess, build, obfuscate, preverify, run, debug, and deploy your application in the Java ME environment.
pt_br: Este projeto usa um script de construção de IDE-gerada Ant e tarefas especiais para pré-processar, construir, obfuscar, pré-verificar, executar, depurar, e implantar sua aplicação no ambiente Java ME.

source: Creates a new Java ME class library in a standard IDE project.
pt_br: Criar uma nova classe de biblioteca Java ME no projeto IDE.

source: A Java ME library does not contain a MIDlet.
pt_br: Uma biblioteca Java ME não contem um MIDlet.

source: This project uses an IDE-generated Ant build script and special tasks to preprocess, build, obfuscate, preverify, run, debug, and deploy your library in the Java ME environment.
pt_br: Este projeto usa um script de construção IDE-gerada Ant e tarefas especiais para pré-processar, construir, obfuscar, pré-verificar, executar, depurar, e implantar sua biblioteca no ambiente Java ME.

source: Creates a new MIDP application in a standard IDE project.
pt_br: Criar uma nova aplicação MIDP no projeto IDE padrão.

source: You can also generate a MIDlet in the project.
pt_br: Voce pode tambem gerar um MIDlet no projeto.

source: Imports an existing MIDP application from Sun Java Wireless Toolkit into a standard IDE project.
pt_br: Importa um aplicativo MIDP existente de kit de ferramenta sem fio Java da Sunno projeto IDE padrão.

source: This project uses an IDE-generated Ant build script and special tasks to preprocess, build, obfuscate, preverify, run, debug, and deploy your application in the J2ME environment.
pt_br: Este projeto usa um script de construção IDE-gerada Ant e tarefas especiais para processar, construir, obfuscar, pré-verificar, executar, depurar, e implantar sua aplicação no ambiente J2ME.

source: The Mobile Application Projects.
pt_br: Projetos de aplicação móvel.

source: Create localization support class for the Java Micro Edition (Java ME) Mobile Information Device Profile (MIDP).
pt_br: Criar classe de suporte a localização para o Profile de Dispositivo de Informação Móvel (MIDP) da edição micro Java (Java ME) .

source: Create a basic executable class for wireless devices.
pt_br: Criar uma classe executel básica para dispositivos sem fio.

source: Create applications for the Java Micro Edition (Java ME) Mobile Information Device Profile (MIDP).
pt_br: Criar aplicações para o Profile de Dispositivo de Informação Móvel (MIDP) da edição micro Java (Java ME).

source: Creates a subclass of the Canvas class (low-level user interface API).
pt_br: Criar uma sub-classe da classe Canvas (API de interface com usuário nível baixo).

source: Canvas gives full control over the appearance of the user interface, but may not be portable across devices.
pt_br: Canvas dá total controle sobre a aparência da interface com usuário, mas pode não ser através de dispositivos portáteis.

source: Empty Java class which uses the default J2ME compiler, debugger and executor.
pt_br: Classe Java vazia que usa o compilador J2ME padrão, depurador e executor.

source: Project Configuration Manager
pt_br: Gerenciador de configuração de projeto

source: Project Configuration Manager panel
pt_br: Painel do gerenciador de configuração de projeto

source: &Use Values from "DefaultConfiguration"
pt_br: &Utilizar valores de "DefaultConfiguration"

source: &Specify the Security Domain:
pt_br: &Especificar a segurança do domínio:

source: Emulator Execution Customizer
pt_br: Personalizar execução de emulador

source: Customize Emulator Execution
pt_br: Personaliza execução do emulador

source: Invalid attribute name.
pt_br: Nome do atributo inválido.

source: Mandatory attribute values cannot be empty.
pt_br: Valor do atributo obrigatório não pode estar vazio.

source: Attribute with this name already exists.
pt_br: Atributo com este nome já existe.

source: Add Attribute into Suite
pt_br: Adiciona atributo no suite

source: Placement:
pt_br: Localização:

source: Add MIDlet into Suite
pt_br: Adicionar MIDlet no suite

source: User attributes with MIDlet- prefix are prohibited by MIDP specification.
pt_br: Atributos de usuário com MIDlet- prefixo são proibidos pela espeficiação MIDP.

source: Invalid New Configuration Name.
pt_br: Nome da nova configuração inválida.

source: Configuration name must be a valid Java identifier.
pt_br: Nome da configuração deve ser um identificador Java válido.

source: Configuration with this name already exists.
pt_br: Configuração com este nome já existe.

source: Select Project Configuration Template.
pt_br: Selecionar modelo de configuração de projeto.

source: &New Configuration Name:
pt_br: Nome da &nova configuração:

source: Obfuscation &Level:
pt_br: &Nível de obfuscação:

source: Customize J2ME Emulator
pt_br: Personalizar emulador J2ME

source: Customize Resources and Libraries
pt_br: Personalizar recursos e bibliotecas

source: Customize Target Files Names and Destinations
pt_br: Personalizar nomes de arquivos destinos e destinação

source: Customize General Project Settings
pt_br: Personalizar configurações gerais de projeto

source: Customize Compilation Parameters
pt_br: Personalizar parâmetros de compilação

source: Some MIDlet classes are invalid.
pt_br: Algumas classes MIDlet são inválidas.

source: Customize MIDlets in the Suite
pt_br: Personalizar MIDlets na suite

source: Add Jar or Zip File
pt_br: Adicionar arquivo jar ou zip

source: Add Folder
pt_br: Adicionar pasta

source: Add Libraries
pt_br: Adicionar biblioteca

source: Jar and Zip Files (*.jar, *.zip)
pt_br: Arquivos jar e zip (*.jar, *.zip)

source: Add Library
pt_br: Adicionar bibliotecas

source: Save Configuation As Template
pt_br: Salvar configurações como modelo

source: Place for saving the configuration as template
pt_br: Lugar para salvar a configuração como modelo

source: &Configuration Template Name:
pt_br: Nome modelo de &configuração:

source: Invalid New Configuration Template Name.
pt_br: Novo nome de modelo de configuração.

source: Configuration template name must be a valid Java identifier.
pt_br: Nome de modelo de configuração deve ser um identificador Java válido.

source: Configuration template with this name already exists and will be overwritten.
pt_br: Modelo de configuração com este nome já existe e será sobrescrito.

source: Name of the saved configuration template.
pt_br: Nome do modelo de configuração salvo.

source: Add Configuration...
pt_br: Adicionar configuração...

source: Project Confi&guration:
pt_br: Confi&guração de projeto

source: &Manage Configurations...
pt_br: Gere&nciar configurações...

source: Add Configuration
pt_br: Adicionar configuração

source: &Category:
pt_br: &Categoria:

source: Platform
pt_br: Plataforma

source: Abilities
pt_br: Habilidades

source: Application Descriptor
pt_br: Descritor de aplicativos

source: Attributes
pt_br: Atributos

source: Push Registry
pt_br: Registro Push

source: API Permissions
pt_br: API de permissões

source: Sources Filtering
pt_br: Filtro de códigos-fonte

source: Compiling
pt_br: Compilação

source: Libraries & Resources
pt_br: Bibliotecas & Recursos

source: Obfuscating
pt_br: Ofuscação

source: Creating JAR
pt_br: Criação do JAR

source: Signing
pt_br: Assinatura

source: Generating Javadoc
pt_br: Geração de Javadoc

source: Select &Deployment Method:
pt_br: &Selecionar método de deployment:

source: Deployment Customizer
pt_br: Personalizador de deployment

source: Customize Project Deployment
pt_br: Personalizar deployment do projeto

source: Override JAR URL in JAD:
pt_br: Sobrescrever URL do JAR no JAD:

source: <html>${dist.jar} will be replaced by the real jar name
pt_br: <html>${dist.jar} será substituído pelo nome real do jar

source: Overrides JAR URL stored within JAD.
pt_br: Sobrescrever a URL do JAR armazenada no JAD.

source: Javac Options:
pt_br: Opções do Javac:

source: Generate &Debugging Info
pt_br: Gerar informações de &depuração

source: C&ompile with Optimization
pt_br: C&ompilar com otimização

source: &Report Uses of Deprecated APIs
pt_br: &Reportar uso de APIs obsoletas

source: Compilation Customizer
pt_br: Personalizador da compilação

source: &Encoding:
pt_br: &Codificação:

source: Debug B&lock Level:
pt_br: Nível de b&loqueio do depurador:

source: Compilation Classpath
pt_br: Classpath de compilação

source: # Property {0} is set here just to make sharing of project simpler.
pt_br: # Esta propriedade {0} é definida apenas para deixar o compartilhamento do projeto mais simples.

source: # The library definition has always preference over this property.
pt_br: # A definição de uma biblioteca é sempre preferível à esta propriedade.

source: &Name:
pt_br: &Nome:

source: You cannot add this attribute here.
pt_br: Você não pode adicionar este atributo aqui.

source: Use category "MIDlets".
pt_br: Utilize categoria "MIDlets".

source: Use category "Push Registry".
pt_br: Utilizar categoria "Registro Push".

source: Use category "Signing".
pt_br: Utilize categoria "Assinatura".

source: Add Attribute
pt_br: Adicionar atributo

source: JAD and Manifest
pt_br: JAD e Manifest

source: <html>${deployment.number} can be used to auto-increment version number after each deployment.
pt_br: <html>${deployment.number} pode ser utilizado para auto-incrementar o número da versão após cada deployment.

source: Pu&sh Registry Entries:
pt_br: Entradas do registro Pu&sh:

source: Move U&p
pt_br: Mover para c&ima

source: MIDlet Class
pt_br: Classe MIDlet

source: Sender IP
pt_br: Ip remenete

source: Connection String
pt_br: String de conexão

source: MIDP-1.0 profile does not support Push Registry.
pt_br: Profile MIDP-1.0 não suporta registro Push.

source: Push Registry Customizer
pt_br: Personalizador de registro Push

source: Customize Push Registry Entries
pt_br: Personalizar entradas de resigtro Push

source: Add Push Registy Entry
pt_br: Adicionar entrada de registro Push

source: Edit Push Registry Entry
pt_br: Editar entrada de registro Push

source: Duplicate The Configuation
pt_br: Duplicar a configuração

source: Place for duplicating the configuration
pt_br: Lugar para duplicar a configuração

source: &Sign Distribution
pt_br: &Assinar distribuição

source: &Keystore:
pt_br: &Repositório de chaves:

source: &Open Keystores Manager...
pt_br: &Abrir gerenciador de repositório de chaves...

source: Unloc&k...
pt_br: Desbloque&ar...

source: U&nlock...
pt_br: D&esbloquear...

source: Certificate Details
pt_br: Detalhe de certificado

source: &Export Key into Java ME SDK/Platform/Emulator...
pt_br: &Exportar chave no emulador/plataform/Java ME SDK...

source: Sign Distribution Customizer
pt_br: Personalilzador de distribuição de assinatura

source: Customize Sign Distribution Settings
pt_br: Personalizar configurações de distribuição de assinaturas

source: Unlocks keystore.
pt_br: Desbloquear repositório de chaves.

source: Unlocks key alias.
pt_br: Desbloqueia chave alias.

source: Project &Folder:
pt_br: &Pasta do projeto:

source: Project &Name:
pt_br: &Nome do Projeto:

source: Required &Projects:
pt_br: &Projetos requeridos:

source: &Rebuild Required Projects
pt_br: &Reconstruir projetos requeridos

source: General Project Customizer
pt_br: Personalizador de projeto geral

source: Project &Sources Location:
pt_br: Localização de &Códigos-fonte de projeto:

source: Requested &Permissions:
pt_br: Permissões solicitadas:

source: Required
pt_br: Obrigatório

source: MIDP-1.0 profile does not support API Permissions.
pt_br: Profile MIDP-1.0 não suporta permissões de API.

source: API Permission Customizer
pt_br: Personalizador de permissão de API

source: Customize API Permission
pt_br: Personalizar permissões de API

source: Add Permission for API
pt_br: Adicionar permissões de API

source: &JAD File Name:
pt_br: Nome do arquivo &JAD:

source: JA&R File Name:
pt_br: Nome do arquivo JA&R:

source: C&ompress JAR
pt_br: C&ompactar JAR

source: Target Files Customizer
pt_br: Personalizador de arquivos destino

source: No CLDC/MIDP platform available.
pt_br: Nenhuma plataforma CLDC/MIDP disponível.

source: Emula&tor Platform:
pt_br: Plataforma emulador:

source: Manag&e Emulators...
pt_br: Ger&enciador de emuladores...

source: &Device:
pt_br: &Dispositivo:

source: Device Con&figuration:
pt_br: Con&figuração de dispositivo:

source: Device &Profile:
pt_br: &Profile de dispositivo:

source: &Optional Packages:
pt_br: Pacote &opcional:

source: J2ME Emulator Customizer
pt_br: Personalizador de emulador J2ME

source: Ability names must be valid Java identifiers.
pt_br: Capacidade nomes devem ser válidos para identificadores Java.

source: An Ability with the specified name already exists.
pt_br: Uma habilidade com o nome especificado já existe.
